; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v3 ?v11)
             (pred_3 ?v8 ?v1)
             (pred_7 ?v3 ?v1)
             (pred_10 ?v7 ?v3 )
	     (pred_2 ?v3)
             (pred_4 ?v6)
             (pred_1 ?v8)
             (pred_12 ?v1)
             (pred_11 ?v3)
             (pred_5 ?v8)
             (pred_6 ?v3)
             (pred_8 ))



(:action op_2
:parameters (?v9 ?v2 ?v10 ?v5)
:precondition (and (pred_4 ?v9) (pred_4 ?v2) (pred_1 ?v10) (pred_12 ?v5)
          (pred_9 ?v9 ?v2) (pred_3 ?v10 ?v5)
                   (pred_7 ?v2 ?v5) (pred_2 ?v9) 
                   (pred_11 ?v2) (pred_5 ?v10))
:effect (and  (pred_6 ?v2) (not (pred_11 ?v2))))


(:action op_1
:parameters (?v9 ?v4)
:precondition (and (pred_4 ?v9) (pred_4 ?v4)
               (pred_2 ?v9) (pred_9 ?v9 ?v4) (pred_6 ?v4))
:effect (and (pred_2 ?v4) (not (pred_2 ?v9))))

(:action op_3
:parameters (?v9 ?v10)
:precondition (and (pred_4 ?v9) (pred_1 ?v10) 
                  (pred_2 ?v9) (pred_10 ?v10 ?v9) (pred_8 ))
:effect (and (pred_5 ?v10)
   (not (pred_10 ?v10 ?v9)) (not (pred_8 ))))


(:action op_5
:parameters (?v9 ?v13 ?v12)
:precondition (and (pred_4 ?v9) (pred_1 ?v13) (pred_1 ?v12)
                  (pred_2 ?v9) (pred_5 ?v12) (pred_10 ?v13 ?v9))
:effect (and (pred_5 ?v13) (pred_10 ?v12 ?v9)
        (not (pred_5 ?v12)) (not (pred_10 ?v13 ?v9))))

(:action op_4
:parameters (?v9 ?v10)
:precondition (and (pred_4 ?v9) (pred_1 ?v10) 
                  (pred_2 ?v9) (pred_5 ?v10))
:effect (and (pred_8 ) (pred_10 ?v10 ?v9) (not (pred_5 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_03 obj_12 obj_26 obj_10 obj_01 obj_23 obj_11 obj_24 obj_06 obj_29 obj_25 obj_20 obj_19 obj_02 obj_31 obj_13 obj_15 obj_16 obj_28 obj_22 obj_30 obj_08 obj_09 obj_07
    obj_17 obj_27 obj_18
    obj_05 obj_21 obj_04
    )

    (:init
       (pred_8)

       (pred_4 obj_14)
       (pred_4 obj_03)
       (pred_4 obj_12)
       (pred_4 obj_26)
       (pred_4 obj_10)
       (pred_4 obj_01)
       (pred_4 obj_23)
       (pred_4 obj_11)
       (pred_4 obj_24)
       (pred_4 obj_06)
       (pred_4 obj_29)
       (pred_4 obj_25)
       (pred_4 obj_20)
       (pred_4 obj_19)
       (pred_4 obj_02)
       (pred_4 obj_31)
       (pred_4 obj_13)
       (pred_4 obj_15)
       (pred_4 obj_16)
       (pred_4 obj_28)
       (pred_4 obj_22)
       (pred_4 obj_30)
       (pred_4 obj_08)
       (pred_4 obj_09)
       (pred_4 obj_07)
       (pred_12 obj_17)
       (pred_12 obj_27)
       (pred_12 obj_18)
       (pred_1 obj_05)
       (pred_1 obj_21)
       (pred_1 obj_04)

       (pred_9 obj_14 obj_01)
       (pred_9 obj_14 obj_03)
       (pred_9 obj_03 obj_23)
       (pred_9 obj_03 obj_12)
       (pred_9 obj_03 obj_14)
       (pred_9 obj_12 obj_11)
       (pred_9 obj_12 obj_26)
       (pred_9 obj_12 obj_03)
       (pred_9 obj_26 obj_24)
       (pred_9 obj_26 obj_10)
       (pred_9 obj_26 obj_12)
       (pred_9 obj_10 obj_06)
       (pred_9 obj_10 obj_26)
       (pred_9 obj_01 obj_29)
       (pred_9 obj_01 obj_23)
       (pred_9 obj_01 obj_14)
       (pred_9 obj_23 obj_25)
       (pred_9 obj_23 obj_11)
       (pred_9 obj_23 obj_03)
       (pred_9 obj_23 obj_01)
       (pred_9 obj_11 obj_20)
       (pred_9 obj_11 obj_24)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_11 obj_23)
       (pred_9 obj_24 obj_19)
       (pred_9 obj_24 obj_06)
       (pred_9 obj_24 obj_26)
       (pred_9 obj_24 obj_11)
       (pred_9 obj_06 obj_02)
       (pred_9 obj_06 obj_10)
       (pred_9 obj_06 obj_24)
       (pred_9 obj_29 obj_31)
       (pred_9 obj_29 obj_25)
       (pred_9 obj_29 obj_01)
       (pred_9 obj_25 obj_13)
       (pred_9 obj_25 obj_20)
       (pred_9 obj_25 obj_23)
       (pred_9 obj_25 obj_29)
       (pred_9 obj_20 obj_15)
       (pred_9 obj_20 obj_19)
       (pred_9 obj_20 obj_11)
       (pred_9 obj_20 obj_25)
       (pred_9 obj_19 obj_16)
       (pred_9 obj_19 obj_02)
       (pred_9 obj_19 obj_24)
       (pred_9 obj_19 obj_20)
       (pred_9 obj_02 obj_28)
       (pred_9 obj_02 obj_06)
       (pred_9 obj_02 obj_19)
       (pred_9 obj_31 obj_22)
       (pred_9 obj_31 obj_13)
       (pred_9 obj_31 obj_29)
       (pred_9 obj_13 obj_30)
       (pred_9 obj_13 obj_15)
       (pred_9 obj_13 obj_25)
       (pred_9 obj_13 obj_31)
       (pred_9 obj_15 obj_08)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_15 obj_20)
       (pred_9 obj_15 obj_13)
       (pred_9 obj_16 obj_09)
       (pred_9 obj_16 obj_28)
       (pred_9 obj_16 obj_19)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_28 obj_07)
       (pred_9 obj_28 obj_02)
       (pred_9 obj_28 obj_16)
       (pred_9 obj_22 obj_30)
       (pred_9 obj_22 obj_31)
       (pred_9 obj_30 obj_08)
       (pred_9 obj_30 obj_13)
       (pred_9 obj_30 obj_22)
       (pred_9 obj_08 obj_09)
       (pred_9 obj_08 obj_15)
       (pred_9 obj_08 obj_30)
       (pred_9 obj_09 obj_07)
       (pred_9 obj_09 obj_16)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_07 obj_28)
       (pred_9 obj_07 obj_09)
       (pred_11 obj_24)
       (pred_11 obj_20)
       (pred_11 obj_22)
       (pred_7  obj_24 obj_17)
       (pred_7  obj_20 obj_27)
       (pred_7  obj_22 obj_18)
       (pred_6 obj_14)
       (pred_6 obj_03)
       (pred_6 obj_12)
       (pred_6 obj_26)
       (pred_6 obj_10)
       (pred_6 obj_01)
       (pred_6 obj_23)
       (pred_6 obj_11)
       (pred_6 obj_06)
       (pred_6 obj_29)
       (pred_6 obj_25)
       (pred_6 obj_19)
       (pred_6 obj_02)
       (pred_6 obj_31)
       (pred_6 obj_13)
       (pred_6 obj_15)
       (pred_6 obj_16)
       (pred_6 obj_28)
       (pred_6 obj_30)
       (pred_6 obj_08)
       (pred_6 obj_09)
       (pred_6 obj_07)

       (pred_3  obj_05 obj_17)
       (pred_3  obj_21 obj_27)
       (pred_3  obj_04 obj_18)
       (pred_10 obj_05 obj_23)
       (pred_10 obj_21 obj_14)
       (pred_10 obj_04 obj_01)
       (pred_2 obj_10)
    )

    (:goal (and
       (pred_10 obj_05 obj_29)
       (pred_10 obj_21 obj_28)
    ))
(:constraints
  (always (not (pred_2 obj_02)))
)
)

; plan
1. (op_1 obj_10 obj_26)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_26)
   goals met: 0 of 2
2. (op_1 obj_26 obj_12)
   deleted: (pred_2 obj_26)
   added: (pred_2 obj_12)
   goals met: 0 of 2
3. (op_1 obj_12 obj_03)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_03)
   goals met: 0 of 2
4. (op_1 obj_03 obj_23)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_23)
   goals met: 0 of 2
5. (op_1 obj_23 obj_25)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_25)
   goals met: 0 of 2
6. (op_1 obj_25 obj_29)
   deleted: (pred_2 obj_25)
   added: (pred_2 obj_29)
   goals met: 0 of 2
7. (op_1 obj_29 obj_01)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_01)
   goals met: 0 of 2
8. (op_1 obj_01 obj_14)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_14)
   goals met: 0 of 2
9. (op_3 obj_14 obj_21)
   deleted: (pred_10 obj_21 obj_14) (pred_8)
   added: (pred_5 obj_21)
   goals met: 0 of 2
10. (op_1 obj_14 obj_01)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_01)
   goals met: 0 of 2
11. (op_1 obj_01 obj_29)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_29)
   goals met: 0 of 2
12. (op_1 obj_29 obj_25)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_25)
   goals met: 0 of 2
13. (op_1 obj_25 obj_13)
   deleted: (pred_2 obj_25)
   added: (pred_2 obj_13)
   goals met: 0 of 2
14. (op_1 obj_13 obj_15)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_15)
   goals met: 0 of 2
15. (op_1 obj_15 obj_16)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_16)
   goals met: 0 of 2
16. (op_1 obj_16 obj_28)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_28)
   goals met: 0 of 2
17. (op_4 obj_28 obj_21)
   deleted: (pred_5 obj_21)
   added: (pred_8) (pred_10 obj_21 obj_28)
   goals met: 1 of 2
18. (op_1 obj_28 obj_16)
   deleted: (pred_2 obj_28)
   added: (pred_2 obj_16)
   goals met: 1 of 2
19. (op_1 obj_16 obj_15)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_15)
   goals met: 1 of 2
20. (op_1 obj_15 obj_13)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_13)
   goals met: 1 of 2
21. (op_1 obj_13 obj_25)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_25)
   goals met: 1 of 2
22. (op_1 obj_25 obj_23)
   deleted: (pred_2 obj_25)
   added: (pred_2 obj_23)
   goals met: 1 of 2
23. (op_3 obj_23 obj_05)
   deleted: (pred_10 obj_05 obj_23) (pred_8)
   added: (pred_5 obj_05)
   goals met: 1 of 2
24. (op_1 obj_23 obj_01)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_01)
   goals met: 1 of 2
25. (op_1 obj_01 obj_29)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_29)
   goals met: 1 of 2
26. (op_4 obj_29 obj_05)
   deleted: (pred_5 obj_05)
   added: (pred_8) (pred_10 obj_05 obj_29)
   goals met: 2 of 2
